app/views/books/index.html.erb

                <td><p>いいね</p></td>
                <td>コメント数: <%= book.book_comments.count %></td>
---
SELECT "books".* FROM "books"