app/views/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                    <%= link_to book_favorites_path(@detail_book),method: :delete do %>
                      ♥<%= @detail_book.favorites.count %>

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
                <% end %>
                  <td>コメント数: <%= @detail_book.book_comments.count %></td>