app/views/searches/search.html.erb

SELECT "users".* FROM "users" WHERE (name LIKE'kake%')
---
          <td><%= user.name %></td>
          <td>フォロー数: <%= user.following_user.count %></td>