app/controllers/books_controller.rb

  def index
    @book = Book.new
    @books = Book.all
---
SELECT "books".* FROM "books"

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "kake2の本"], ["body", "kake2の本の説明"], ["user_id", 2], ["created_at", "2021-11-28 10:29:18.006784"], ["updated_at", "2021-11-28 10:29:18.006784"]]

  def show
    @book = Book.new
    @detail_book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]