app/controllers/book_comments_controller.rb

  def create
    @detail_book = Book.find(params[:book_id])
    comment = current_user.book_comments.new(book_comment_params)
    comment.book_id = @detail_book.id
    comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "kakeのコメント"], ["user_id", 1], ["book_id", 1], ["created_at", "2021-11-28 10:30:01.106240"], ["updated_at", "2021-11-28 10:30:01.106240"]]

  def destroy
    book_comment = BookComment.find_by(id:params[:id])
    book_comment.destroy
    @detail_book = Book.find(book_comment.book.id)
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def baria_user
    unless
      BookComment.find_by(id:params[:id]).user_id == current_user.id
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]