app/controllers/searches_controller.rb

SELECT "users".* FROM "users" WHERE (name LIKE'kake%')
---
  def search
    @range = params[:range]
    @word = params[:word]

    if @range == '1'
      @users = User.search(params[:search], @word)